In [1]:
import pandas as pd
from numpy import math

In [2]:
kosdaq = pd.read_csv("kosdaq_day_17011046.csv")

In [3]:
nasdaq = pd.read_csv("nasdaq.csv")

In [4]:
kosdaq.head()

,통계표,계정항목,단위,변환,2022/02/17,2022/02/18,2022/02/21,2022/02/22,2022/02/23,2022/02/24,...,2023/02/03,2023/02/06,2023/02/07,2023/02/08,2023/02/09,2023/02/10,2023/02/13,2023/02/14,2023/02/15,2023/02/16
0,1.5.1.1. 주식시장(일),KOSDAQ지수,1996.07.01=1000,원자료,874.22,881.71,884.25,868.11,877.33,848.21,...,766.79,761.33,772.79,779.98,784.58,772.44,772.55,779.58,765.46,784.71

In [5]:
nasdaq.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2022-02-17,14004.190430,14020.820313,13704.700195,13716.719727,13716.719727,4278370000
1,2022-02-18,13735.400391,13762.400391,13465.559570,13548.070313,13548.070313,4501940000
2,2022-02-22,13424.360352,13618.719727,13249.650391,13381.519531,13381.519531,4849170000
3,2022-02-23,13511.750000,13533.780273,13032.169922,13037.490234,13037.490234,4639330000
4,2022-02-24,12587.879883,13486.110352,12587.879883,13473.589844,13473.589844,6180200000

In [18]:
nasdaq.tail()

,Date,Open,High,Low,Close,Adj Close,Volume
245,2023-02-09,12069.099609,12070.959961,11745.110352,11789.580078,11789.580078,5536290000
246,2023-02-10,11714.599609,11775.799805,11630.540039,11718.120117,11718.120117,4885030000
247,2023-02-13,11759.089844,11910.919922,11719.730469,11891.790039,11891.790039,4752880000
248,2023-02-14,11808.200195,11999.849609,11760.559570,11960.150391,11960.150391,5032430000
249,2023-02-15,11905.120117,12071.290039,11876.820313,12070.589844,12070.589844,5056640000

In [6]:
kosdaq.melt()

       variable             value
0           통계표  1.5.1.1. 주식시장(일)
1          계정항목          KOSDAQ지수
2            단위   1996.07.01=1000
3            변환               원자료
4    2022/02/17            874.22
..          ...               ...
248  2023/02/10            772.44
249  2023/02/13            772.55
250  2023/02/14            779.58
251  2023/02/15            765.46
252  2023/02/16            784.71

[253 rows x 2 columns]

In [7]:
type(kosdaq.melt().iloc[5,0])

str

In [8]:
kosdaq.melt().iloc[5,0]

'2022/02/18'

In [9]:
import datetime as dt

In [10]:
kosdaq_sub = kosdaq.melt().iloc[4:,:]

In [21]:
kosdaq_sub.head()

         Date   Price
0  2022/02/17  874.22
1  2022/02/18  881.71
2  2022/02/21  884.25
3  2022/02/22  868.11
4  2022/02/23  877.33

In [19]:
kosdaq_sub.tail()

           Date   Price
244  2023/02/10  772.44
245  2023/02/13  772.55
246  2023/02/14  779.58
247  2023/02/15  765.46
248  2023/02/16  784.71

In [11]:
kosdaq_sub = kosdaq_sub.rename(columns={"variable":"Date", "value":"Price"}).reset_index(drop=True)

In [12]:
pd.to_datetime(nasdaq["Date"]).dt.hour

0      0
1      0
2      0
3      0
4      0
      ..
245    0
246    0
247    0
248    0
249    0
Name: Date, Length: 250, dtype: int64

In [13]:
nasdaq_sub = nasdaq.loc[:,["Date","Close"]]

In [14]:
nasdaq_sub = nasdaq_sub.rename(columns={"Close":"Price"})

In [15]:
nasdaq_sub

           Date         Price
0    2022-02-17  13716.719727
1    2022-02-18  13548.070313
2    2022-02-22  13381.519531
3    2022-02-23  13037.490234
4    2022-02-24  13473.589844
..          ...           ...
245  2023-02-09  11789.580078
246  2023-02-10  11718.120117
247  2023-02-13  11891.790039
248  2023-02-14  11960.150391
249  2023-02-15  12070.589844

[250 rows x 2 columns]

In [16]:
kosdaq_sub

           Date   Price
0    2022/02/17  874.22
1    2022/02/18  881.71
2    2022/02/21  884.25
3    2022/02/22  868.11
4    2022/02/23  877.33
..          ...     ...
244  2023/02/10  772.44
245  2023/02/13  772.55
246  2023/02/14  779.58
247  2023/02/15  765.46
248  2023/02/16  784.71

[249 rows x 2 columns]

In [17]:
kosdaq_sub.iloc[0:,1].reset_index(drop=True).apply(func=math.log)

0      6.781863
1      6.784740
2      6.766318
3      6.776883
4      6.743128
         ...
243    6.649554
244    6.649697
245    6.658755
246    6.640477
247    6.665314
Name: Price, Length: 248, dtype: float64

In [18]:
df_income_rate = (kosdaq_sub.iloc[1:,1].reset_index(drop=True).apply(func=math.log) - kosdaq_sub.iloc[0:-1,1].apply(func=math.log))*250

In [19]:
df_income_rate.tail()

243   -3.898552
244    0.035599
245    2.264645
246   -4.569588
247    6.209316
Name: Price, dtype: float64

In [20]:
df_income_rate = df_income_rate.rename(index=dict(zip(df_income_rate.index,[x for x in range(1,len(df_income_rate)+1)])))